Repository: sdbruder/wingcgcalc
Catalog: translations/*/LC_MESSAGES/wingcgcalc.po
Languages: pt_br

source: Flying Wing CG Calculator
pt_br: Calculadora de CG

source: Contact
pt_br: Contato

source: Measures
pt_br: Medidas

source: Options
pt_br: Opções

source: Unit System
pt_br: Sistema de unidades

source: Metric
pt_br: Métrico

source: CG Position
pt_br: Posição do CG

source: For tailless wings, start with 15% for beginners going to 25% for experts. Trainers airplanes normally use 25-33%.
pt_br: Para asas voadoras começe com 15% para iniciantes até 25% para pilotos experientes. Treinadores asa alta normalmente usam 25 à 33%.

source: Panel span
pt_br: Envergadura

source: Span of this panel in the semiwing (Ex: If your wing has 1200mm span and only one panel, use 600mm).
pt_br: Envergadura deste painel na semi-asa (Ex: Se sua asa tem 1200mm de envergadura e apenas um painel, use 600mm).

source: Panel Span
pt_br: Envergadura

source: Root chord
pt_br: Corda na raiz

source: Chord in the root of this panel
pt_br: Corda na raiz deste painel

source: Root Chord
pt_br: Corda na Raiz

source: Tip chord
pt_br: Corda na ponta

source: Chord in the tip of this panel
pt_br: Corda na ponta deste painel

source: Tip Chord
pt_br: Corda na Ponta

source: Sweep
pt_br: Enflechamento

source: For forward swept wings use negative values.
pt_br: Para asas de enflechamento positivo use valores negativos.

source: Panel %d
pt_br: Painel %d

source: For forward swept wings panels use negative values.
pt_br: Para painéis de enflechamento positivo use valores negativos.

source: Wing
pt_br: Asa

source: Results
pt_br: Resultados

source: Wing Area
pt_br: Área da Asa

source: MAC Distance
pt_br: MAC - Distância

source: MAC Length
pt_br: MAC - Comprimento

source: About
pt_br: Sobre

source: Ive used the excelent work of z80 (<a href="http://fwcg.3dzone.dk/">http://fwcg.3dzone.dk/</a>) in the past, but the limitations of one single panel and no forward sweep made me look for multi-panel CG calcs, and Ive found only very old windows programs. Accustomed to the online and direct use of z80's tool, Ive decided to make my own online CG calculator, with forward sweep and multiple panels.
pt_br: Eu usei o excelente trabalho do z80 (<a href="http://fwcg.3dzone.dk/">http://fwcg.3dzone.dk/</a>) no passado, mas as limitações de apenas um painel e a falta de suporte a enflechamento positivo me fizeram procurar por calculadoras de CG multi-paineis e apenas encontrei velhos programas em Windows. Acostumado ao uso online da ferramenta (e não tendo um Windows à mão o tempo inteiro) decidi fazer minha própria calculadora online de CG com suporte a enflechamento positivo e múltiplos painéis.

source: WingCGCalc is a flying wing CG calculator flexible enough to calculate complex wings, with multiple panels and forward swept. As the percentual position of the MAC for the CG is also configurable, you can use it with standard airplanes (with tail) too, It's only a question of configuring the right amount.
pt_br: WingCGCalc é um calculadora de CG para asas voadoras flexível o suficiente para calcular asas complexas, com múltiplos painéis com enflechamento positivo. Como o percentual do MAC para o CG também é configurável, você também pode usá-la para aviões tradicionais (com cauda), é apenas uma questão de configurar o percentual correto.

source: Deep-link for wings designs
pt_br: Deep-link para desenhos de asas

source: Save option to build a database of wings designs
pt_br: Opção Salvar para construir um banco de dados de desenhos de asas

source: Some helper drawings exemplifying in the wing image what is the current measure been edited.
pt_br: Alguns desenhos de ajuda exemplificando na imagem da asa qual é a medida sendo editada.

source: Any other ideias? Please contact me.
pt_br: Alguma outra idéia? Por favor entre em contato.

source: History
pt_br: Histórico

source: Added About and History in end of the page.
pt_br: Adicionado Sobre e História no final da página.

source: Proper internationalization with gettext support. If you want wingcgcalc in your language and can contribute with the translation, please contact me.
pt_br: Internacionalização corretamente implementada com gettext. Se você quer wingcgcalc em seu idioma e pode contribuir com a tradução, por favor entre em contato.

source: Options moved to the start of the measures forms, a few users didnt found the CG % with it the end.
pt_br: Opções movidas para o início do formulário de medidas, alguns poucos usuários não encontravam a configuração de ponto percentual do MAC para o CG no final do formulário.

source: Popups implemented with little helper texts for each entry.
pt_br: Popups implementados com pequenos textos de ajuda para cada entrada.

source: Brazilian Portuguese translation added.
pt_br: Tradução Português Brasileiro adicionada.

source: Unit system switch between metric and imperial systems.
pt_br: Troca de sistema de unidades entre os sistemas métrico e imperial.

source: A little less broken with Internet Explorers (still without canvas support).
pt_br: Ligeiramente menos quebrado com Internet Explorers (ainda sem suporte à canvas).

source: Initial version.
pt_br: Versão inicial.

source: Internet Explorer not supported
pt_br: Internet Explorer não suportado

source: WingCGCalc uses a great deal of HTML5, javascript and canvas support, which Internet Explorer currently cant support (there is no CANVAS in Internet Explorer, for example). Sorry. Use any other modern browser.
pt_br: WingCGCalc usa extensivamente HTML5, javascript e canvas e Internet Explorer não tem o suporte adequado (não existe canvas em IE, por exemplo). Desculpe-nos. Use qualquer outro browser moderno.

source: i18n bugfixing.
pt_br: Correções de internacionalização

source: A proper build system, Makefile and so on.
pt_br: Um build system apropriado, Makefile e o escambau.

source: big rework to allow deep linking to arbitrary wings with bit.ly url shorting.
pt_br: URL para designs de asa encurtadas com bit.ly.

source: if the url shortening fails in any way use the full URL instead.
pt_br: se a abreviação da URL falhar de qualquer maneira, usa-se a URL inteira no lugar.

source: Better wing drawings: whole wing and measuring in the canvas
pt_br: Medidas e asa completa no desenho

source: BUGFIX: the MAC calculation for multi-panel was wrong, corrected.
pt_br: BUGFIX: o cálculo do MAC para asas multi-painéis estava errado, corrigido graças ao LaercioLMB from e-voo.com.

source: New display code and html arrange in the page now shows the whole wing.
pt_br: Novo código canvas e arranjo HTML agora desenham a asa completa.

source: BUGFIX: the MAC calculation for multi-panel was wrong, corrected thanks to LaercioLMB from e-voo.com.
pt_br: BUGFIX: o cálculo do MAC para asas multi-painéis estava errado, corrigido graças ao LaercioLMB from e-voo.com.

source: Deep linking URL
pt_br: URL deep linking

source: Link to my wing!
pt_br: Link para minha asa!

source: For forward swept wings use negative values. Enter the sweep value to calculate the angle and vice-versa.
pt_br: Para asas de enflechamento negativo use valores negativos. Forneça o enflechamento para calcular o ângulo e vice-versa.

source: Angle
pt_br: Ângulo

source: For forward swept wings use negative values. Enter the angle in degrees to calculate the sweep value and vice-versa.
pt_br: Para asas de enflechamento negativo use valores negativos. Forneça o ângulo em graus para calcular o enflechamento e vice-versa.

source: Short it!
pt_br: Encolha!

source: No more DOS in bit.ly, manual URL shorting.
pt_br: Nada mais de ataques DOS involuntários em bit.ly, encolhimento manual de URLS

source: Now with angle recalculated as needed when span and/or sweep values are changed and vice-versa.
pt_br: Agora com ângulo recalculado quando envergadura e/ou enflechamento mudarem e vice-versa.

source: BUGFIX: Firefox fixes.
pt_br: BUGFIX: Correções para Firefox.

source: URL shorting is now manual.
pt_br: Encurtamento de URL's agora é manual.

source: Draw the measures.
pt_br: Desenhe medidas.

source: Save image
pt_br: Salvar imagem

source: Save canvas as image.
pt_br: Salve o canvas como imagem.

source: Note: We are limited by the current available API and cant choose an appropriate name of the saved file.
pt_br: Nota: Estamos limitados pela API atualmente disponível e não podemos escolher um nome apropriado para o arquivo PNG salvo.

source: Weight
pt_br: Peso

source: Enter the total flying weight to calculate the wing load.
pt_br: Informe o peso total para vôo para calcular a carga alar da asa.

source: Wing Load
pt_br: Carga Alar

source: Wing loading calculation.
pt_br: Cálculo de carga alar.

source: BUGFIX: URL shorting now has a smaller timeout, 2 seconds.
pt_br: BUGFIX: Encurtador de URL's agora tem timeout de 2 segundos.

source: BUGFIX: Small translation issues.
pt_br: BUGFIX: Pequenos erros de tradução.

source: new bootstrap and small layout tweaks.
pt_br: novo bootstrap and pequenas alterações de layout.

source: you can now change languages without loosing your wing.
pt_br: Você agora pode trocar de idioma sem perder sua asa.

source: deeplink is now language agnostic.
pt_br: Deeplink agora é agnóstico a linguagem, quem seguir seu link pode ver a asa em outro idioma.

source: some code re-arrangement.
pt_br: Algum manutenção interna de código.
